[
  {
    "message": "Число 16k записано в k-ичной позиционной системе счисления (k - основание этой системы). При каких k это число (16k) будет НЕчетным?",
    "answers": [
      "k = 7",
      "k = 9"
    ]
  },
  {
    "message": "Число 15k записано в k-ичной позиционной системе счисления (k - основание этой системы). При каких k это число (15k) будет НЕчетным?",
    "answers": [
      "k = 6",
      "k = 8"
    ]
  },
  {
    "message": "Число 15k записано в k-ичной позиционной системе счисления (k - основание этой системы). При каком минимальном k это число (15k) будет НЕчетным?",
    "answers": [
      "min k = 6"
    ]
  },
  {
    "message": "Число 16k записано в k-ичной позиционной системе счисления (k - основание этой системы). При каком минимальном k это число (16k) будет НЕчетным?",
    "answers": [
      "min k = 7"
    ]
  },
  {
    "message": "Число 16k записано в k-ичной позиционной системе счисления (k - основание этой системы). Для каких k такая запись этого числа будет корректной?",
    "answers": [
      "k = 8",
      "k = 16"
    ]
  },
  {
    "message": "Число 15k записано в k-ичной позиционной системе счисления (k - основание этой системы). Для каких k такая запись этого числа будет корректной?",
    "answers": [
      "k = 6",
      "k = 16"
    ]
  },
  {
    "message": "Число 14k записано в k-ичной позиционной системе счисления (k - основание этой системы). Для каких k такая запись этого числа будет корректной?",
    "answers": [
      "k = 4",
      "k = 16"
    ]
  },
  {
    "message": "В корзине лежат шары. Все разного цвета. Сообщение о том, что из корзины достали синий шар, несёт 5 битов информации. Сколько всего шаров было в корзине?",
    "answers": [
      "32 шара"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 4). Сколько \"нулей\" в двоичной записи этого числа?",
    "answers": [
      "52 нуля"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 2). Сколько \"нулей\" в двоичной записи этого числа?",
    "answers": [
      "52 нуля"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 1). Сколько \"нулей\" в двоичной записи этого числа?",
    "answers": [
      "52 нуля"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 4). Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "2 единицы"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 2). Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "2 единицы"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 + 1). Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "2 единицы"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 - 1). Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "2 единицы"
    ]
  },
  {
    "message": "Десятичное число N10 = (253 - 1). Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "53 единицы"
    ]
  },
  {
    "message": "Десятичное число N10 = 253. Сколько \"единиц\" в двоичной записи этого числа?",
    "answers": [
      "одна единица"
    ]
  },
  {
    "message": "Десятичное число N10 = 253. Сколько \"нулей\" в двоичной записи этого числа?",
    "answers": [
      "52 нуля"
    ]
  },
  {
    "message": "Сколько бит информации получено из сообщения «Вася живет на пятом этаже», если в доме 16 этажей?",
    "answers": [
      "4"
    ]
  },
  {
    "message": "Считая, что каждый символ кодируется одним байтом, определите, чему равен информационный объём следующего высказывания Алексея Толстого: \"Не ошибается тот, кто ничего не делает, хотя это и есть его основная ошибка.\" (Всего символов в высказывании — 76).",
    "answers": [
      "608 бит"
    ]
  },
  {
    "message": "Сколько вопросов достаточно задать собеседнику для выяснения даты его рождения, при условии, что год рождения собеседника вам известен, все его ответы достоверны и представлены в бинарной форме: \"да\" или \"нет\"?",
    "answers": [
      "9"
    ]
  },
  {
    "message": "На каком из уровней информационной пирамиды (модель DIKW) может быть принято решение об отчислении плохо успевающих студентов или решение о поощрении студентов за отличные достижения в учебе, спорте или научной работе?",
    "answers": [
      "Понимание"
    ]
  },
  {
    "message": "К какому из уровней информационной пирамиды (модель DIKW) следует отнести рейтинговые списки студентов, построенные по результатам экзаменационной сессии?",
    "answers": [
      "Информация"
    ]
  },
  {
    "message": "К какому из уровней информационной пирамиды (модель DIKW) следует отнести множество оценок, полученных студентами во время экзаменационной сессии?",
    "answers": [
      "Данные"
    ]
  },
  {
    "message": "Сколько битов информации несет достоверное сообщение о том, что искомый объект находится в каком-то одном из 512 закрытых контейнеров?",
    "answers": [
      "9"
    ]
  },
  {
    "message": "Сколько битов информации несет достоверное сообщение о том, что искомый объект находится внутри единственного закрытого контейнера?",
    "answers": [
      "1"
    ]
  },
  {
    "message": "Сколько бит информации несет достоверное сообщение о том, что искомый объект находится в каком-то одном из 4-х закрытых контейнеров?",
    "answers": [
      "2"
    ]
  },
  {
    "message": "Производим случайный выбор из колоды одной из 32-х игральных карт. Сколько битов информации содержит сообщение о выбранной карте?",
    "answers": [
      "5 бит"
    ]
  },
  {
    "message": "Получено информационное сообщение длиной X знаков, заданное в P-ичном алфавите. Определите количество информации I, содержащейся в таком сообщении.",
    "answers": [
      "I = X?Log2P"
    ]
  },
  {
    "message": "Количество информации I, содержащейся в информационном сообщении, определяется по формуле (N – количество равновероятных ожидаемых вариантов сообщения):",
    "answers": [
      "I = Log2N"
    ]
  },
  {
    "message": "База данных информационной системы хранит 100 000 документов. В ответ на свой запрос пользователь получил список из 100 документов, из которых 50 оказались релевантными запросу. Оцените полноту системы при условии, что в её базе данных содержится 500 документов, релевантных данному запросу.",
    "answers": [
      "10 %"
    ]
  },
  {
    "message": "База данных информационной системы хранит 100 000 документов. В ответ на свой запрос пользователь получил список из 100 документов, из которых 50 оказались релевантными запросу. Оцените релевантность системы при условии, что в её базе данных содержится 500 документов, релевантных данному запросу.",
    "answers": [
      "50 %"
    ]
  },
  {
    "message": "Представьте шестнадцатеричное число FF,2h в десятичной системе счисления",
    "answers": [
      "255,125"
    ]
  },
  {
    "message": "Представьте десятичное число 16,25 в шестнадцатеричной системе счисления",
    "answers": [
      "10,4h"
    ]
  },
  {
    "message": "Представьте десятичное число 256,125 в шестнадцатеричной системе счисления",
    "answers": [
      "100,2h"
    ]
  },
  {
    "message": "Представьте десятичное число 1024,5 в шестнадцатеричной системе счисления",
    "answers": [
      "400,8h"
    ]
  },
  {
    "message": "Представьте десятичное число 4096,25 в шестнадцатеричной системе счисления",
    "answers": [
      "1000,4h"
    ]
  },
  {
    "message": "Представьте десятичное число 8,25 в двоичной системе счисления",
    "answers": [
      "1000,01b"
    ]
  },
  {
    "message": "Представьте десятичное число 7,125 в двоичной системе счисления",
    "answers": [
      "111,001b"
    ]
  },
  {
    "message": "Представьте десятичное число 0,25 в двоичной системе счисления",
    "answers": [
      "0,01b"
    ]
  },
  {
    "message": "Представьте десятичное число 0,5 в двоичной системе счисления",
    "answers": [
      "0,1b"
    ]
  },
  {
    "message": "Представьте десятичное число 4098 в шестнадцатеричной системе счисления",
    "answers": [
      "1002h"
    ]
  },
  {
    "message": "Представьте двоичное число 1011 1110b в шестнадцатеричной системе счисления",
    "answers": [
      "BEh"
    ]
  },
  {
    "message": "Представьте двоичное число 1010 1010b в десятичной системе счисления",
    "answers": [
      "170"
    ]
  },
  {
    "message": "Представьте десятичное число 253 в двоичной системе счисления",
    "answers": [
      "1111 1101b"
    ]
  },
  {
    "message": "Какое из шестнадцатеричных чисел соответствует двоичному числу 10000,001b ?",
    "answers": [
      "10,1h"
    ]
  },
  {
    "message": "В каких системах счисления может быть записано число 222 ?",
    "answers": [
      "В троичной, восьмеричной и десятичной"
    ]
  },
  {
    "message": "В какой из систем счисления оба ответа будут правильными? 100?100=10000100+100=1000",
    "answers": [
      "В двоичной"
    ]
  },
  {
    "message": "Какое из двоичных чисел соответствует шестнадцатеричному числу ABCDh ?",
    "answers": [
      "1010 1011 1100 1101b"
    ]
  },
  {
    "message": "Сколько нулей в записи двоичного числа, соответствующего десятичному числу, вычисленному по формуле: 2^16 + 2^8 + 2^4 + 2^2 ?",
    "answers": [
      "13"
    ]
  },
  {
    "message": "Сколько единиц в записи двоичного числа, соответствующего десятичному числу, вычисленному по формуле: 2^153 + 2^53 + 2^3 ?",
    "answers": [
      "3"
    ]
  },
  {
    "message": "Что обозначено выражением ki в формуле, используемой для вычисления значения числа Nk, заданного в k-ичной позиционной системе счисления?",
    "answers": [
      "Позиционный вес базисного числа b, записанного в i-той позиции"
    ]
  },
  {
    "message": "Что обозначено переменной i в формуле, используемой для вычисления значения числа Nk, заданного в k-ичной позиционной системе счисления?",
    "answers": [
      "Номер позиции, в которой записано базисное число b"
    ]
  },
  {
    "message": "Что обозначено переменной b в формуле, используемой для вычисления значения числа Nk, заданного в k-ичной позиционной системе счисления?",
    "answers": [
      "Одно из базисных чисел k-ичной системы счисления"
    ]
  },
  {
    "message": "Что называется основанием позиционной системы счисления?",
    "answers": [
      "Наибольшее базисное число системы счисления"
    ]
  },
  {
    "message": "Какой из числовых наборов представляет все базисные числа двоичной системы счисления?",
    "answers": [
      "0, 1"
    ]
  },
  {
    "message": "Какой из числовых наборов представляет все базисные числа восьмеричной системы счисления?",
    "answers": [
      "0, 1, 2, 3, 4, 5, 6, 7"
    ]
  },
  {
    "message": "Какой из числовых наборов представляет все базисные числа десятичной системы счисления?",
    "answers": [
      "0, 1, 2, 3, 4, 5, 6, 7, 8, 9"
    ]
  },
  {
    "message": "Как будет представлено десятичное число 264 в римской системе счисления?",
    "answers": [
      "CCLXIV"
    ]
  },
  {
    "message": "Какому десятичному числу соответствует число MDCXCVII, записанное в римской системе счисления?",
    "answers": [
      "1697"
    ]
  },
  {
    "message": "Какому десятичному числу соответствует число DCXLIX, записанное в римской системе счисления?",
    "answers": [
      "649"
    ]
  },
  {
    "message": "Какие из перечисленных систем счисления относятся к категории аддитивно-мультипликативных (позиционных)?",
    "answers": [
      "Двоичная и десятичная"
    ]
  },
  {
    "message": "Какие из перечисленных систем счисления относятся к категории аддитивных?",
    "answers": [
      "Унарная и римская"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение отрицательного числа -32,5. Как будет представлено это число в памяти компьютера?",
    "answers": [
      "С202000016"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение 32,5. Как будет представлено это число в памяти?",
    "answers": [
      "4202000016"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение 0,0625 (1/16). Как представлен в памяти компьютера порядок этого числа?",
    "answers": [
      "011110112"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение 32,5. Как представлен в памяти компьютера порядок этого числа?",
    "answers": [
      "100001002"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение 0,0625 (1/16). Как представлена в памяти компьютера нормализованная мантисса числа?",
    "answers": [
      "000010000000000000000002"
    ]
  },
  {
    "message": "Переменная типа float (32-битный формат стандарта IEEE-754) получила значение 32,5. Как представлена в памяти компьютера нормализованная мантисса числа?",
    "answers": [
      "000001000000000000000002"
    ]
  },
  {
    "message": "Какая из записей числа 3,14159 представляет это число в денормализованной форме?",
    "answers": [
      "0,314159*101"
    ]
  },
  {
    "message": "Какая из записей числа 3,14159 представляет это число в нормализованной форме?",
    "answers": [
      "314,159*10-2"
    ]
  },
  {
    "message": "Что называют порядком P k-ичного вещественного числа Z, значение которого вычисляется по формуле Z = M ? E?",
    "answers": [
      "P = Log k E"
    ]
  },
  {
    "message": "Что называют мантиссой M k-ичного вещественного числа Z, значение которого вычисляется по формуле Z = M ? E?",
    "answers": [
      "Число, представленное всеми цифрами числа Z с сохранением порядка"
    ]
  },
  {
    "message": "Однобайтовая ячейка памяти содержит двоичное число, эквивалентное шестнадцатеричному числу 81h. Определите значение записанного в эту ячейку десятичного числа при условии, что на эту ячейку отображается переменная, представляющая целые числа со знаком.",
    "answers": [
      "+127"
    ]
  },
  {
    "message": "Однобайтовая ячейка памяти содержит двоичное число, эквивалентное шестнадцатеричному числу FFh. Определите значение записанного в эту ячейку десятичного числа при условии, что на эту ячейку отображается переменная, представляющая целые числа со знаком.",
    "answers": [
      "-1"
    ]
  },
  {
    "message": "Однобайтовая ячейка памяти содержит двоичное число, эквивалентное шестнадцатеричному числу A0h. Определите значение записанного в эту ячейку десятичного числа при условии, что на эту ячейку отображается переменная, представляющая целые числа со знаком.",
    "answers": [
      "-96"
    ]
  },
  {
    "message": "Однобайтовая ячейка памяти содержит двоичное число, эквивалентное шестнадцатеричному числу 10h. Определите значение записанного в эту ячейку десятичного числа при условии, что на эту ячейку отображается переменная, представляющая целые числа со знаком.",
    "answers": [
      "+16"
    ]
  },
  {
    "message": "Переменная, представляющая 1-байтовые целые числа со знаком, получила значение десятичного числа \"-127\". Каким двоичным числом представлено это значение в памяти ЭВМ?",
    "answers": [
      "1111 1111"
    ]
  },
  {
    "message": "Переменная, представляющая 1-байтовые целые числа со знаком, получила значение десятичного числа \"+1\". Каким двоичным числом представлено это значение в памяти ЭВМ?",
    "answers": [
      "0000 0001"
    ]
  },
  {
    "message": "Диапазон допустимых значений переменной типа «целое со знаком» длиной в 1 байт составляет (в десятичной системе счисления):",
    "answers": [
      "-128 … 127"
    ]
  },
  {
    "message": "Диапазон допустимых значений переменной беззнакового целого типа длиной в 2 байта составляет (в десятичной системе счисления):",
    "answers": [
      "0 … 65535"
    ]
  },
  {
    "message": "Диапазон допустимых значений переменной беззнакового целого типа длиной в 1 байт составляет (в десятичной системе счисления):",
    "answers": [
      "0 … 255"
    ]
  },
  {
    "message": "Программа-«шифратор» англоязычного текста ASCII-формата уменьшает на 32 код каждой буквы этого текста. Как изменится текст после такого «шифрования»?",
    "answers": [
      "Среди предложенных ответов отсутствует правильный"
    ]
  },
  {
    "message": "Программа-«шифратор» англоязычного текста ASCII-формата увеличивает на 32 код каждой прописной (заглавной) буквы этого текста. Как изменится текст после такого «шифрования»?",
    "answers": [
      "Прописные буквы станут строчными"
    ]
  },
  {
    "message": "Студентка Арбузова сменила фамилию на Watermelon, и этот факт был официально зарегистрирован в списке студентов, после чего список был заново отсортирован в алфавитном порядке (сверху вниз по возрастанию). Как изменилось положение фамилии этой (бывшей Арбузовой) студентки в обновленном списке?",
    "answers": [
      "Переместилось вверх"
    ]
  },
  {
    "message": "Список фамилий русскоязычных студентов, представленный в кодировке Windows Cp1251, программно сортируется в алфавитном порядке (сверху вниз по возрастанию). При очередном редактировании списка была допущена опечатка при написании фамилии студента Афанасьева – он  был записан, как афанасьев. Как изменится положение фамилии этого студента?",
    "answers": [
      "Переместится вниз"
    ]
  },
  {
    "message": "Текстовый файл ASCII-формата содержит неупорядоченный список именованных объектов, при этом имя объекта состоит из любой (одной) цифры или буквы основной или дополнительной кодовой таблицы (например: 7, d, W, я или Д). После сортировки списка (в алфавитном порядке имен, по возрастанию) объекты будут расположены в следующем порядке",
    "answers": [
      "цифра –прописная буква латиницы – строчная буква латиницы – пропи"
    ]
  },
  {
    "message": "Текстовый файл формата UniCode содержит слово ИНФОРМАТИКА, записанное в одной строке. Сколько памяти займет этот файл в буфере ОЗУ ?",
    "answers": [
      "22 байта"
    ]
  },
  {
    "message": "Текстовый файл ASCII-формата содержит слово ИНФОРМАТИКА, записанное в один столбец (по одной букве в строке). Сколько памяти займет этот файл в буфере ОЗУ ?",
    "answers": [
      "33 байта"
    ]
  },
  {
    "message": "Текстовый файл ASCII-формата содержит слово ИНФОРМАТИКА, записанное в одной строке. Сколько памяти займет этот файл в буфере ОЗУ ?",
    "answers": [
      "11 байтов"
    ]
  },
  {
    "message": "Мощность алфавита, символы которого кодируются по стандарту UNICODE, не должна превышать:",
    "answers": [
      "65536 знаков"
    ]
  },
  {
    "message": "Мощность алфавита, символы которого кодируются по стандарту ASCII, не должна превышать:",
    "answers": [
      "256 знаков"
    ]
  },
  {
    "message": "Язык какой из 'машин' используется для оценки количества информации по алгоритмическому методу?",
    "answers": [
      "Машина Тюринга"
    ]
  },
  {
    "message": "Основная единица измерения количества информации – это:",
    "answers": [
      "Bit"
    ]
  },
  {
    "message": "Эргономичность информации – это:",
    "answers": [
      "Свойство, характеризующее форму её представления получателю информации"
    ]
  },
  {
    "message": "Какое из внешних свойств информации представлено следующим определением: 'Свойство информации, определяющее наличие (и количество) скрытых ошибок'?",
    "answers": [
      "Достоверность"
    ]
  },
  {
    "message": "Какое из внешних свойств информации представлено следующим определением: 'Свойство информации, определяющее степень ее соответствия запросу получателя информационного сообщения'?",
    "answers": [
      "Релевантность"
    ]
  },
  {
    "message": "К внешним свойствам информации, по которым её оценивает получатель информационного сообщения, можно отнести:",
    "answers": [
      "Релевантность, полноту, достоверность, своевременность"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение об аппаратных прерываниях",
    "answers": [
      "Источником внешнего аппаратного прерывания может быть любое устройство ввода-вывода"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о программных прерываниях",
    "answers": [
      "Программные прерывания инициируются инструкциями вида INT <№ прерывания>"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о системе обработки прерываний ПК",
    "answers": [
      "Вектор прерывания – это сегментный адрес первой команды программы обработки прерывания"
    ]
  },
  {
    "message": "Сегментный адрес расположения вектора 8-го прерывания вычисляется по формуле:",
    "answers": [
      "[0000 : 0020]h"
    ]
  },
  {
    "message": "Начальный адрес программы обработки N-ного прерывания вычисляется по формуле:",
    "answers": [
      "[0000 : 8?N]h"
    ]
  },
  {
    "message": "Сегментный адрес расположения вектора N-ного прерывания вычисляется по формуле:",
    "answers": [
      "[0000 : 4?N]h"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о таблице векторов прерываний",
    "answers": [
      "Эта таблица обеспечивает хранение не более 256 векторов прерываний"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о таблице векторов прерываний",
    "answers": [
      "Таблица векторов прерываний – это линейная структура данных в области памяти"
    ]
  },
  {
    "message": "Выберите одно ЛОЖНОЕ утверждение о контроллере прерываний Intel 8259A",
    "answers": [
      "Регистр маскирования прерываний IMR используется для запрета обработки прерываний"
    ]
  },
  {
    "message": "Выберите одно ЛОЖНОЕ утверждение о контроллере прерываний Intel 8259A",
    "answers": [
      "Этот контроллер формирует вектор прерывания – адрес программы-обработчика прерывания"
    ]
  },
  {
    "message": "Выберите одно ЛОЖНОЕ утверждение о режимах доступа к портам ввода-вывода:",
    "answers": [
      "Использование режима «I/O mapped I/O» может приводить к потере пространства адресов"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о режимах доступа к портам ввода-вывода:",
    "answers": [
      "Использование режима «Memory mapped I/O» уменьшает размер основного адресного пространства"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о режимах доступа к портам ввода-вывода:",
    "answers": [
      "В режиме «Memory mapped I/O» адресное пространство ввода-вывода занимает основное адресное пространство"
    ]
  },
  {
    "message": "Порт ввода-вывода – это:",
    "answers": [
      "Однобайтовый регистр (ячейка памяти) адаптера периферийного устройства"
    ]
  },
  {
    "message": "Выберите одно ЛОЖНОЕ утверждение о периферийных устройствах ПК",
    "answers": [
      "Модули RAM являются периферийными устройствами"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о периферийных устройствах ПК",
    "answers": [
      "К периферийным относятся запоминающие устройства всех типов"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение об области данных BIOS (Bios variable)",
    "answers": [
      "Область данных BIOS предназначена для хранения системных функций"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о запоминающих устройствах компьютера",
    "answers": [
      "Устройства HMDD существенно проигрывают устройствам SSD по скорости"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о запоминающих устройствах компьютера",
    "answers": [
      "CMOS (КМОП)-память является энергонезависимым внешним запоминающим устройством"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о запоминающих устройствах компьютера",
    "answers": [
      "Статическая память (S RAM) существенно выигрывает по производительности у динамической памяти (D RAM)"
    ]
  },
  {
    "message": "Какой из сегментных адресов соответствует линейному адресу 0041Ch ?",
    "answers": [
      "(0041:000C)h"
    ]
  },
  {
    "message": "Какой из сегментных адресов соответствует линейному адресу 0041Bh ?",
    "answers": [
      "(0038:003B)h"
    ]
  },
  {
    "message": "Какой из сегментных адресов соответствует линейному адресу 0041Ah ?",
    "answers": [
      "(0040:001A)h"
    ]
  },
  {
    "message": "Какой из сегментных адресов соответствует линейному адресу 0041Eh ?",
    "answers": [
      "(0040:001E)h"
    ]
  },
  {
    "message": "Какой из линейных адресов соответствует сегментному адресу (F00F:F00F)h ?",
    "answers": [
      "FFFFFh"
    ]
  },
  {
    "message": "Какой из линейных адресов соответствует сегментному адресу (B800:4002)h ?",
    "answers": [
      "BC002h"
    ]
  },
  {
    "message": "Какой из линейных адресов соответствует сегментному адресу (0040:001E)h ?",
    "answers": [
      "01E40h"
    ]
  },
  {
    "message": "Какой из линейных адресов соответствует сегментному адресу (1234:1234)h ?",
    "answers": [
      "(3412:3412)h"
    ]
  },
  {
    "message": "Что называют базовым адресом сегмента памяти?",
    "answers": [
      "Линейный адрес начального байта сегмента"
    ]
  },
  {
    "message": "Какая из операций выполняется сумматором адреса микропроцессора Intel-8086 (LA - линейный адрес, CS - содержимое сегментного регистра, IP - содержимое регистра смещения) ?",
    "answers": [
      "LA = CS + IP"
    ]
  },
  {
    "message": "Какая информация содержится в регистре-указателе команд IP микропроцессора Intel-8086 ?",
    "answers": [
      "Величина смещения относительно начала выделенного сегмента памяти"
    ]
  },
  {
    "message": "Какая информация содержится в сегментных регистрах микропроцессора Intel-8086 ?",
    "answers": [
      "Сегментные адреса ячеек памяти, выделенных для хранения очередной"
    ]
  },
  {
    "message": "Максимально допустимый объем прямо-адресуемой памяти ПК, имеющего 32-х разрядную адресную шину, равен :",
    "answers": [
      "4 Гб"
    ]
  },
  {
    "message": "Максимально допустимый объем прямо-адресуемой памяти ПК, имеющего 24-х разрядную адресную шину, равен :",
    "answers": [
      "16 Мб"
    ]
  },
  {
    "message": "Максимально допустимый объем прямо-адресуемой памяти ПК, имеющего 16-разрядную адресную шину, равен :",
    "answers": [
      "64 Кб"
    ]
  },
  {
    "message": "Как влияет разрядность n (в битах) адресной шины компьютера на максимально допустимый объем M (в байтах) адресного пространства?",
    "answers": [
      "M = 2^n"
    ]
  },
  {
    "message": "В каком коде передаются данные по системной шине ПК ?",
    "answers": [
      "В параллельном двоичном коде"
    ]
  },
  {
    "message": "Машинное слово – это :",
    "answers": [
      "единица данных, обрабатываемая в АЛУ за один цикл"
    ]
  },
  {
    "message": "Что декларирует принцип однородности памяти фон-неймановской ЭВМ ?",
    "answers": [
      "И программа, и обрабатываемые программой данные хранятся единообразно в памяти"
    ]
  },
  {
    "message": "Система однобайтового кодирования цвета символов в текстовых видеорежимах использует цветовую RGB-модель. Какое числовое (десятичное) значение получил цветовой атрибут этого символа, если на экране отображен белый символ на мигающем черном фоне ?",
    "answers": [
      "143"
    ]
  },
  {
    "message": "Система однобайтового кодирования цвета символов в текстовых видеорежимах использует цветовую RGB-модель. Какое числовое (десятичное) значение получил цветовой атрибут этого символа, если на экране отображен черный символ на белом фоне ?",
    "answers": [
      "112"
    ]
  },
  {
    "message": "Система однобайтового кодирования цвета символов в текстовых видеорежимах использует цветовую RGB-модель. Как будет отображен на экране символ, если двоичный код его цветового атрибута получил значение, соответствующее десятичному числу 15 ?",
    "answers": [
      "Белый символ на черном фоне"
    ]
  },
  {
    "message": "Система однобайтового кодирования цвета символов в текстовых видеорежимах использует цветовую RGB-модель. Как будет отображен на экране символ, если двоичный код его цветового атрибута получил значение, соответствующее десятичному числу 156 ?",
    "answers": [
      "Ярко-красный символ на голубом фоне"
    ]
  },
  {
    "message": "Таблица знакогенератора VGA, кодирующая «точечный» образ каждого из 256 текстовых символов кодовой таблицы битовой матрицей размером (8?16), занимает блок ПЗУ с начальным адресом [C000:69ED]h.Определите начальный адрес блока памяти, используемого для хранения кода образа символа с ASCII-кодом 81h.",
    "answers": [
      "[C000:71FD]h"
    ]
  },
  {
    "message": "В таблице знакогенератора VGA «точечный» образ каждого текстового символа кодируется битовой матрицей размером (8?16). Определите размер блока памяти (в байтах), необходимый для хранения таблицы знакогенератора, кодирующей набор из 256 ASCII-символов.",
    "answers": [
      "1000h"
    ]
  },
  {
    "message": "Таблица знакогенератора СGA, кодирующая «точечный» образ каждого текстового символа дополнительной кодовой таблицы (кириллица) битовой матрицей размером (8?8), занимает блок ОЗУ с начальным адресом [0507:0866]h.Определите начальный адрес блока памяти, используемого для хранения кода образа символа с ASCII-кодом 81h.",
    "answers": [
      "[0507:086E]h"
    ]
  },
  {
    "message": "Прикладная программа выводит текстовый символ в знакоместо экрана с координатами (64; 16). Определите адрес ячейки видеопамяти, в которую будет записан код этого символа, при условии, что установлен стандартный текстовый видеорежим (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона), и запись производится в видеостраницу",
    "answers": [
      "[B800:3А80]h."
    ]
  },
  {
    "message": "Прикладная программа выводит текстовый символ в крайнее левое знакоместо верхней строки экрана. Определите адрес ячейки видеопамяти, в которую будет записан код этого символа, при условии, что установлен стандартный текстовый видеорежим (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона) и запись производится в видеостраницу",
    "answers": [
      "[B800:2000]h."
    ]
  },
  {
    "message": "Для стандартного текстового видеорежима (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона) выделен блок видеопамяти с начальным адресом [B800:0000]h.Сколько видеостраниц можно организовать в таком блоке для этого видеорежима?",
    "answers": [
      "8"
    ]
  },
  {
    "message": "Для стандартного текстового видеорежима (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона) выделен блок видеопамяти с начальным адресом [B800:0000]h.Определите начальный адрес видеостраницы №2 для этого видеорежима.",
    "answers": [
      "[B800:2000]h."
    ]
  },
  {
    "message": "Для стандартного текстового видеорежима (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона) выделен блок видеопамяти в диапазоне адресов с [B800:0000]h  по [B800:7FFF]h.Определите размер такого блока видеопамяти.",
    "answers": [
      "32 Кб"
    ]
  },
  {
    "message": "Какой размер видеостраницы будет установлен для реализации стандартного графического видеорежима (320×200 пикселей, 256 цветов)?",
    "answers": [
      "64 Кб"
    ]
  },
  {
    "message": "Какой размер видеостраницы будет установлен для реализации стандартного текстового видеорежима (80×25 экранных знакомест, 16 цветов символа, 16 цветов фона)?",
    "answers": [
      "4 Кб"
    ]
  },
  {
    "message": "Видеопамять ПК используется для",
    "answers": [
      "для обмена данными между видеоадаптером и программами, выполняемыми на компьютере."
    ]
  },
  {
    "message": "В области данных BIOS зарезервировано 2 байта для хранения так называемых «флагов клавиатуры». Какая программа производит запись данных в эти «флаги»?",
    "answers": [
      "Программа сканирования наборного поля клавиатуры"
    ]
  },
  {
    "message": "В области данных BIOS зарезервировано 2 байта для хранения так называемых «флагов клавиатуры». Какую информацию несут эти «флаги»?",
    "answers": [
      "Информацию о состоянии управляющих клавишей и клавишей-переключателей"
    ]
  },
  {
    "message": "Вектор прерывания №9 (клавиатура) расположен по адресу",
    "answers": [
      "[0000 : 0024]h"
    ]
  },
  {
    "message": "Порт 60h адресного пространства ввода-вывода используется для временного хранения скан-кодов клавишей. Какая программа (или устройство) считывает скан-код из этого порта?",
    "answers": [
      "Программа обработки прерывания №9"
    ]
  },
  {
    "message": "Порт 60h адресного пространства ввода-вывода используется для временного хранения скан-кодов клавишей. Какая программа (или устройство) записывает скан-код в этот порт?",
    "answers": [
      "Контроллер клавиатуры"
    ]
  },
  {
    "message": "Однобайтовый скан-код (scan-code) клавиши позволяет закодировать не более, чем",
    "answers": [
      "128 клавиш наборного поля"
    ]
  },
  {
    "message": "Однобайтовый скан-код (scan-code) клавиши несет информацию о:",
    "answers": [
      "расположении этой клавиши на наборном поле клавиатуры и виде манипуляции нажатия или отпускания этой клавиши"
    ]
  },
  {
    "message": "Выберите одно ЛОЖНОЕ утверждение о контроллере клавиатуры ПК",
    "answers": [
      "Обмен данными между контроллером клавиатуры и программой обработки производится через прерывание от контроллера прерываний IRQ1"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о контроллере клавиатуры ПК",
    "answers": [
      "Контроллер клавиатуры передает запрос на прерывание центральному процессору через контроллер прерываний"
    ]
  },
  {
    "message": "Выберите одно ИСТИННОЕ утверждение о контроллере клавиатуры ПК",
    "answers": [
      "Контроллер клавиатуры периодически сканирует наборное поле и вычисляет скан-код нажатой (или отпущенной) клавиши"
    ]
  },
  {
    "message": "Сколько секторов займет таблица FAT на томе, отформатированном в системе FAT-16, если рабочая область тома содержит 32768 (215) кластеров?",
    "answers": [
      "128 секторов"
    ]
  },
  {
    "message": "Сколько секторов займет таблица FAT на томе, отформатированном в системе FAT-12, если рабочая область тома содержит 2847 кластеров?",
    "answers": [
      "9 секторов"
    ]
  },
  {
    "message": "Максимально допустимое количество кластеров на томе, отформатированном в системе FAT-16:",
    "answers": [
      "65532 кластера"
    ]
  },
  {
    "message": "Максимально допустимое количество кластеров на томе, отформатированном в системе FAT-12:",
    "answers": [
      "4096 кластеров"
    ]
  },
  {
    "message": "Том отформатирован в системе FAT-16 с размером кластеров 1 Кб. Командой MD на этом томе создан каталог, в который затем последовательно копируются файлы с короткими DOS-именами. Сколько таких файлов будет скопировано прежде, чем потребуется увеличение первоначального размера каталога?",
    "answers": [
      "30 файлов"
    ]
  },
  {
    "message": "Сколько единиц дискового пространства будет зарезервировано на томе, отформатированном в системе FAT, для хранения подчиненного каталога в момент его создания командой MD?",
    "answers": [
      "1 кластер"
    ]
  },
  {
    "message": "Содержимое каких структур данных файловой системы FAT изменится после удаления файла командой DEL?",
    "answers": [
      "Таблица FAT и родительский каталог удаленного файла"
    ]
  },
  {
    "message": "В какой структуре данных хранятся адреса томов, сформированных при форматировании диска в системе FAT?",
    "answers": [
      "Root Directory"
    ]
  },
  {
    "message": "Первый шаг алгоритма определения объема свободного дискового пространства на томе, отформатированном в системе FAT:",
    "answers": [
      "Сканирование рабочей области тома с целью определения количества свободных кластеров"
    ]
  },
  {
    "message": "Первый шаг алгоритма поиска файла в процессе реализации следующей команды:Type .\\MyFile.txt",
    "answers": [
      "Поиск в текущем («открытом») каталоге адресной ссылки на объект с именем MyFile и расширением txt"
    ]
  },
  {
    "message": "Первый шаг алгоритма поиска файла в процессе реализации следующей команды:Type MyFile.txt",
    "answers": [
      "Поиск адресной ссылки на объект типа «файл» с именем MyFile и расширением txt"
    ]
  },
  {
    "message": "Первый шаг алгоритма поиска файла в процессе реализации следующей команды:Type \\MyFile.txt",
    "answers": [
      "Поиск адресной ссылки на объект типа «файл» с именем MyFile и расширением txt в текущем («открытом») каталоге"
    ]
  },
  {
    "message": "Как в FAT-системах организована адресная ссылка на родительский каталог в подчиненном каталоге?",
    "answers": [
      "В дочернем каталоге создается специальная запись со ссылкой на родительский каталог"
    ]
  },
  {
    "message": "Как в FAT-системах организована адресная ссылка на дочерние объекты каталогов?",
    "answers": [
      "В родительском каталоге указываются номера начальных кластеров для каждого дочернего объекта"
    ]
  },
  {
    "message": "Сколько секторов занимает таблица FAT на томе емкостью 1 Гб (230б), отформатированном в системе FAT-16 с размером кластера 4 Кб?",
    "answers": [
      "210"
    ]
  },
  {
    "message": "Что означает числовой параметр в обозначениях FAT-12, FAT-16 и FAT-32?",
    "answers": [
      "Размер в битах каждого элемента таблицы FAT"
    ]
  },
  {
    "message": "Максимально-возможное количество кластеров на томе, отформатированном в системе FAT-16, равно:",
    "answers": [
      "65532"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'таблица разделов диска' (Partition Table)'",
    "answers": [
      "Таблица разделов содержит информацию о физическом размещении каждого раздела на диске"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'Boot Record' в FAT-системах",
    "answers": [
      "Boot Record содержит информацию о параметрах форматирования тома"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'Boot Record' в FAT-системах",
    "answers": [
      "Boot Record – это исполнимый файл с кодом загрузки ОС, ссылка на который содержится в главной загрузочной записи (MBR – Master Boot Record)"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'метка тома' в FAT-системах",
    "answers": [
      "Метка тома – это имя 'фиктивного' файла со специальным значением для идентификации тома"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'таблица FAT'",
    "answers": [
      "Удаление файла командой DEL изменяет содержимое таблицы FAT того тома, в котором был удаленный файл"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'таблица FAT'",
    "answers": [
      "Создание на томе нового каталога командой MD изменяет содержимое таблицы FAT того тома, в котором был созданный каталог"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'таблица FAT'",
    "answers": [
      "FAT содержит начальные адреса всех файлов тома"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'таблица FAT'",
    "answers": [
      "FAT содержит информацию о количестве свободных и 'сбойных' кластерах"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'подчиненный каталог' в FAT-системах",
    "answers": [
      "Подчиненный каталог создается командой MD и удаляется командой RM"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'подчиненный каталог' в FAT-системах",
    "answers": [
      "Размер подчиненного каталога динамически изменяется в зависимости от количества хранимых в нем объектов"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'подчиненный каталог' в FAT-системах",
    "answers": [
      "Подчиненный каталог – это место хранения дочерних объектов"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'корневой каталог' в FAT-системах",
    "answers": [
      "Корневой каталог имеет фиксированный размер, определяемый в процессе форматирования тома"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'корневой каталог' в FAT-системах",
    "answers": [
      "Корневой каталог содержит имена и начальные адреса дочерних объектов (файлов и подкаталогов)"
    ]
  },
  {
    "message": "Выберите одно истинное утверждение об объекте 'корневой каталог' в FAT-системах",
    "answers": [
      "Корневой каталог – это место хранения дочерних объектов"
    ]
  }
]